/*
Напишите код хеш-таблицы государственных праздников stateHolidays, которая будет содержать месяцы и праздничные даты:
Январь — 1, 7;
Февраль — 23;
Март — 8;
Май — 1, 9;
Июнь — 12;
Ноябрь — 4.
 */
import java.util.HashMap;
import java.util.ArrayList;

public class Main {
    public static void main(String[] args) {
        
        System.out.println(stateHolidays);
    }
}